// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

let height = 23;
let width = 10;

let s = ((height * 2) + (width *2));
console.log(s)


// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

let heightC = 10;
let dc = 4;

let v = (3.14 * (4*4) * 10);
console.log(v)


// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

let n = 3;
let m = 4;


let l = Math.pow(3,2) + Math.pow(4,2);
let k = Math.sqrt(l);
console.log(k);


//
// - Визначити відповідний оператор в виразах що б вийшов відповідний результат.
//     В однакових виразах не використовувати однакові оператори!!!
//     5 < 6 -> true

let a1 = 5 < 6;
console.log(a1);

// 5 == 6 -> false

let a2 = 5 == 6;
console.log(a2)


// 5  6 -> false

let a3 = 5 === 6;
console.log(a3);


// 5 > 6 -> false

let a4 = 5 > 6;
console.log(a4);


// 10 ? 10 -> true

let a5 = 10 == 10;
console.log(a5);

// 10 ? 10 -> true

let a6 = 10 === 10;
console.log(a6);

// 10 ? 10 -> false

let a7 = 10 < 10;
console.log(a7);

// 10 ? 10 -> false

let a8 = 10 < 10;
console.log(a8);

// 10 ? 10 -> false

let a9 = 10 !== 10;
console.log(a9);
// 123 ? '123' -> false

let a10 = 123 < 123;
console.log(a10);

// 123 ? '123' -> true

let a11 = 123 === 123;
console.log(a11);